class AcListTitle {
  //////////-------------------------------------->( ภาพรวม )
  List<Map<String, String>> ac_1 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "2",
      "st": "1",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "ผู้เช่า",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "ระยะเวลาเช่า",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "วันเริ่มสัญญา",
    },
    {
      "ser": "6",
      "st": "1",
      "pn": "วันสิ้นสุดสัญญา",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "ค้างชำระ",
    },
  ];
  //////////-------------------------------------->( ค้างชำระ )
  List<Map<String, String>> ac_2 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "0",
      "pn": "เลขตั้งหนี้",
    },
    {
      "ser": "2",
      "st": "0",
      "pn": "เลขที่วางบิล",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "6",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รายการ",
    },
    {
      "ser": "8",
      "st": "1",
      "pn": "กำหนดชำระ",
    },
    {
      "ser": "9",
      "st": "1",
      "pn": "ค้างชำระ",
    },
  ];
  //////////-------------------------------------->( วางบิล )
  List<Map<String, String>> ac_3 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "ลำดับ",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "2",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "เดือน",
    },
    {
      "ser": "6",
      "st": "1",
      "pn": "ปี",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "ยอดรวม",
    },
  ];
  //////////-------------------------------------->( ประวัติวางบิล-1 )
  List<Map<String, String>> ac_4_1 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "เลขที่ใบแจ้งหนี้",
    },
    {
      "ser": "2",
      "st": "1",
      "pn": "วันที่ทำรายการ",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "กำหนดชำระ",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "5",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "6",
      "st": "1",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "8",
      "st": "1",
      "pn": "ช่องทางชำระ",
    },
    {
      "ser": "9",
      "st": "0",
      "pn": "ส่วนลด",
    },
    {
      "ser": "10",
      "st": "0",
      "pn": "ยอดรวม",
    },
    {
      "ser": "11",
      "st": "1",
      "pn": "ยอดสุทธิ",
    },
    {
      "ser": "12",
      "st": "1",
      "pn": "รหัสอ้างอิง",
    },
    {
      "ser": "13",
      "st": "0",
      "pn": "Ref1",
    },
    {
      "ser": "14",
      "st": "0",
      "pn": "Ref2",
    },
  ];

  //////////-------------------------------------->( ประวัติวางบิล-3 /ชำระแล้ว)
  List<Map<String, String>> ac_4_3 = [
    {
      "ser": "0",
      "st": "0",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "เลขที่ใบแจ้งหนี้",
    },
    {
      "ser": "2",
      "st": "0",
      "pn": "วันที่ออกใบแจ้งหนี้",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "กำหนดชำระ",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "5",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "6",
      "st": "0",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "8",
      "st": "1",
      "pn": "ยอดสุทธิ(วางบิล)",
    },
    {
      "ser": "9",
      "st": "1",
      "pn": "วันที่ชำระ",
    },
    {
      "ser": "10",
      "st": "1",
      "pn": "ใบเสร็จรับชำระ",
    },
    {
      "ser": "11",
      "st": "1",
      "pn": "สถานะ",
    },
    {
      "ser": "12",
      "st": "1",
      "pn": "ค่าปรับ(รับชำระ)",
    },
    {
      "ser": "13",
      "st": "1",
      "pn": "ยอดสุทธิ(รับชำระ)",
    },
    {
      "ser": "14",
      "st": "1",
      "pn": "รหัสอ้างอิง",
    },
    {
      "ser": "15",
      "st": "0",
      "pn": "Ref1",
    },
    {
      "ser": "16",
      "st": "0",
      "pn": "Ref2",
    },
  ];
  //////////-------------------------------------->( รายการชำระ(รอตรวจสอบ) )
  List<Map<String, String>> ac_5 = [
    {
      "ser": "0",
      "st": "0",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "วันที่ทำรายการ",
    },
    {
      "ser": "2",
      "st": "1",
      "pn": "ล็อกเสียบ(วันแรก)",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "วันที่รับชำระ",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "เลขที่ใบเสร็จ",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "เลขที่ใบวางบิล",
    },
    {
      "ser": "6",
      "st": "0",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "8",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "9",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "10",
      "st": "1",
      "pn": "จำนวนเงิน",
    },
    {
      "ser": "11",
      "st": "1",
      "pn": "รูปแบบชำระ",
    },
    {
      "ser": "12",
      "st": "1",
      "pn": "รหัสอ้างอิง",
    },
    {
      "ser": "13",
      "st": "0",
      "pn": "Ref1",
    },
    {
      "ser": "14",
      "st": "0",
      "pn": "Ref2",
    },
    {
      "ser": "15",
      "st": "0",
      "pn": "ทำรายการ",
    },
    {
      "ser": "16",
      "st": "0",
      "pn": "ประเภท",
    },
    // {
    //   "ser": "15",
    //   "st": "1",
    //   "pn": "...",
    // },
  ];
  //////////-------------------------------------->( ชำระบิล )
  List<Map<String, String>> ac_6 = [];
  //////////-------------------------------------->( ประวัติชำระ )
  List<Map<String, String>> ac_7 = [
    {
      "ser": "0",
      "st": "0",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "วันที่ทำรายการ",
    },
    {
      "ser": "2",
      "st": "1",
      "pn": "วันที่รับชำระ",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "เลขที่ใบเสร็จ",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "เลขที่ใบกำกับภาษี",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "เลขที่ใบวางบิล",
    },
    {
      "ser": "6",
      "st": "0",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "8",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "9",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "10",
      "st": "1",
      "pn": "จำนวนเงิน",
    },
    {
      "ser": "11",
      "st": "0",
      "pn": "กำหนดชำระ",
    },
    {
      "ser": "12",
      "st": "1",
      "pn": "ช่องทางชำระ",
    },
    {
      "ser": "13",
      "st": "0",
      "pn": "ทำรายการ",
    },
    {
      "ser": "14",
      "st": "0",
      "pn": "สถานะ",
    },
    {
      "ser": "15",
      "st": "1",
      "pn": "รหัสอ้างอิง",
    },
    {
      "ser": "16",
      "st": "0",
      "pn": "Ref1",
    },
    {
      "ser": "17",
      "st": "0",
      "pn": "Ref2",
    },
  ];
  //////////-------------------------------------->( ประวัติชำระ(ยกเลิก) )
  List<Map<String, String>> ac9_1 = [
    {
      "ser": "0",
      "st": "0",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "วันที่ทำรายการ",
    },
    {
      "ser": "2",
      "st": "1",
      "pn": "วันที่รับชำระ",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "เลขที่ใบเสร็จ",
    },
    {
      "ser": "4",
      "st": "0",
      "pn": "เลขที่ใบกำกับภาษี",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "เลขที่ใบวางบิล",
    },
    {
      "ser": "6",
      "st": "0",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "8",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "9",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "10",
      "st": "1",
      "pn": "จำนวนเงิน",
    },
    {
      "ser": "11",
      "st": "0",
      "pn": "กำหนดชำระ",
    },
    {
      "ser": "12",
      "st": "0",
      "pn": "ช่องทางชำระ",
    },
    {
      "ser": "13",
      "st": "0",
      "pn": "ทำรายการ",
    },
    {
      "ser": "14",
      "st": "0",
      "pn": "สถานะ",
    },
    {
      "ser": "15",
      "st": "1",
      "pn": "เหตุผล",
    },
  ];
  //////////-------------------------------------->( ประวัติวางบิล(ยกเลิก) )
  List<Map<String, String>> ac9_2 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "เลขที่ใบแจ้งหนี้",
    },
    {
      "ser": "2",
      "st": "0",
      "pn": "วันที่ออกใบแจ้งหนี้",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "กำหนดชำระ",
    },
    {
      "ser": "4",
      "st": "0",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "6",
      "st": "0",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "8",
      "st": "0",
      "pn": "ช่องทางชำระ",
    },
    {
      "ser": "9",
      "st": "0",
      "pn": "ส่วนลด",
    },
    {
      "ser": "10",
      "st": "0",
      "pn": "ยอดรวม",
    },
    {
      "ser": "11",
      "st": "1",
      "pn": "ยอดสุทธิ",
    },
    {
      "ser": "12",
      "st": "0",
      "pn": "สถานะ",
    },
    {
      "ser": "13",
      "st": "1",
      "pn": "เหตุผล",
    },
  ];

  //////////-------------------------------------->( รายการชำระ(รอตรวจสอบ)-ยกเลิก )
  List<Map<String, String>> ac9_3 = [
    {
      "ser": "0",
      "st": "0",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "วันที่ทำรายการ",
    },
    {
      "ser": "2",
      "st": "1",
      "pn": "ล็อกเสียบ(วันแรก)",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "วันที่รับชำระ",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "เลขที่ใบเสร็จ",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "เลขที่ใบวางบิล",
    },
    {
      "ser": "6",
      "st": "0",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "8",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "9",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "10",
      "st": "1",
      "pn": "จำนวนเงิน",
    },
    {
      "ser": "11",
      "st": "0",
      "pn": "รูปแบบชำระ",
    },
    {
      "ser": "12",
      "st": "0",
      "pn": "รหัสอ้างอิง",
    },
    {
      "ser": "13",
      "st": "0",
      "pn": "Ref1",
    },
    {
      "ser": "14",
      "st": "0",
      "pn": "Ref2",
    },
    {
      "ser": "15",
      "st": "0",
      "pn": "ทำรายการ",
    },
    {
      "ser": "16",
      "st": "0",
      "pn": "ประเภท",
    },
    {
      "ser": "17",
      "st": "1",
      "pn": "เหตุผล",
    },
  ];

  //////////-------------------------------------->( รายการรับ-เงินประกัน )
  List<Map<String, String>> ac10_1 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "เลขที่ใบเสร็จ",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "2",
      "st": "0",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "5",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "6",
      "st": "1",
      "pn": "เลขตั้งหนี้",
    },
    {
      "ser": "7",
      "st": "0",
      "pn": "รายการ",
    },
    {
      "ser": "8",
      "st": "1",
      "pn": "วันที่รับชำระ",
    },
    {
      "ser": "9",
      "st": "0",
      "pn": "สถานะ",
    },
    {
      "ser": "10",
      "st": "1",
      "pn": "ยอดสุทธิ",
    },
  ];
  //////////-------------------------------------->( รายการคืน-เงินประกัน ) Account_RefundPakan
  List<Map<String, String>> ac10_2 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "เลขที่ใบเสร็จ",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "เลขที่สัญญา",
    },
    {
      "ser": "2",
      "st": "0",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "ชื่อผู้เช่า",
    },
    {
      "ser": "5",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "6",
      "st": "1",
      "pn": "วันที่ชำระ",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "รูปแบบชำระ",
    },
    {
      "ser": "8",
      "st": "1",
      "pn": "ยอดสุทธิ",
    }
    // {
    //   "ser": "7",
    //   "st": "0",
    //   "pn": "รายการ",
    // },
    // {
    //   "ser": "8",
    //   "st": "1",
    //   "pn": "วันที่ชำระ",
    // },
    // {
    //   "ser": "9",
    //   "st": "0",
    //   "pn": "สถานะ",
    // },
    // {
    //   "ser": "10",
    //   "st": "1",
    //   "pn": "ยอดสุทธิ",
    // },
  ];
}
