class PeListTitle {
  //////////-------------------------------------->( ภาพรวม )
  List<Map<String, String>> Pe_1 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "เลขที่สัญญา/เสนอราคา",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "เลขที่สัญญา-เดิม",
    },
    {
      "ser": "2",
      "st": "1",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "3",
      "st": "1",
      "pn": "รหัสพื้นที่",
    },
    {
      "ser": "4",
      "st": "0",
      "pn": "ชื่อร้านค้า",
    },
    {
      "ser": "5",
      "st": "1",
      "pn": "ชื่อผู้ติดต่อ",
    },
    {
      "ser": "6",
      "st": "0",
      "pn": "ระยะเวลาเช่า",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "เริ่มสัญญา",
    },
    {
      "ser": "8",
      "st": "1",
      "pn": "สิ้นสุดสัญญา",
    },
    {
      "ser": "9",
      "st": "1",
      "pn": "สถานะ",
    },
    {
      "ser": "10",
      "st": "1",
      "pn": "เลขอ้างอิง",
    },
  ];
}
