class ChaoListTitle {
  //////////-------------------------------------->( ภาพรวม )
  List<Map<String, String>> chao_1 = [
    {
      "ser": "0",
      "st": "1",
      "pn": "โซนพื้นที่",
    },
    {
      "ser": "1",
      "st": "1",
      "pn": "ชือพื้นที่",
    },
    {
      "ser": "2",
      "st": "0",
      "pn": "ขนาดพื้นที่(ตร.ม.)",
    },
    {
      "ser": "3",
      "st": "0",
      "pn": "ค่าเช่าต่องวด",
    },
    {
      "ser": "4",
      "st": "1",
      "pn": "เลขที่ใบสัญญา",
    },
    {
      "ser": "5",
      "st": "0",
      "pn": "เลขที่ใบเสนอราคา",
    },
    {
      "ser": "6",
      "st": "1",
      "pn": "วันเริ่มสัญญา",
    },
    {
      "ser": "7",
      "st": "1",
      "pn": "วันสิ้นสุดสัญญา",
    },
    {
      "ser": "8",
      "st": "1",
      "pn": "ประเภทร้านค้า",
    },
    {
      "ser": "9",
      "st": "1",
      "pn": "การกระทำ",
    },
    {
      "ser": "10",
      "st": "1",
      "pn": "สถานะ",
    },
  ];
}
